//计算机中数字都是以补码形式存储的，其中正数原、反、补码相同、
//负数最高位为符号位，负数符号位为1，其反码是符号位不变，其他位按位取反，补码为反码加1
//左移操作符:将原数字二进制补码向左移动一位，后面补0，而后以原码形式输出
//PS:无论正数还是负数，左移一位相当于乘以2
//#include<stdio.h>
//int main()
//{
//	int a = 5;
//	a = a << 1;
//	printf("%d", a);
//}
//右移操作符:与左移操作符相似，将其二进制补码向右一位，而后翻译成源码输出
//算数右移:右移一位后最高位补符号位
//逻辑右移:右移一位后最高位补0
//其中现在计算机都是算数右移
//PS:正数右移代表除以2
//#include <stdio.h>
//int main()
//{
//	int a, b, c;
//	a = 5;
//	c = ++a;
//	b = ++c, c++, ++a, a++;
//	b += a++ + c;
//	printf("a = %d b = %d c = %d\n:", a, b, c);
//	return 0;
//}
//不创建零时变量，交换两个变量的值
//#include<stdio.h>
//int main()
//{
//	int a = 20;
//	int b = 10;
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("a=%d b=%d", a, b);
//	return 0;
//}
//&按位与操作符：按照二进制补码其中1 1为1，0 0为0，1 0为0
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("%d", a & b);//结果为1
	//a:00000000000000000000000000000011
	//b:00000000000000000000000000000101
	//c:00000000000000000000000000000001->1
//	return 0;
//}
//|按位或操作符：按照二进制补码形式进行存出，其中0 0为0 ，0 1为1，1 1为1
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
	/*printf("%d", a | b);*/
	//a:00000000000000000000000000000011
	//b:00000000000000000000000000000101
	//c:00000000000000000000000000000111->7
//	return 0;
//}
//^按位异或操作符：按照二进制补码相同为0，不同为1；
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("%d", a ^ b);
	//a:00000000000000000000000000000011
	//b:00000000000000000000000000000101
	//c:00000000000000000000000000000110->6
//	return 0;
//}
//按位异或最大的用途：不创建变量交换两个变量的值
//交换两个整型变量的三种方法:
//方法一：利用按位异或操作符
//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	a = a ^ b;
//	b = a ^ b;
//	a = a  ^b;
//	printf("a=%d b=%d", a, b);
//	return 0;
//}
//方法二：利用加法，容易发生栈溢出
//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	a = a + b;
//	b = a - b;
//	a = a - b;
//	printf("a=%d b=%d", a, b);
//	return 0;
//}
//方法三：创建零时变量
//#include<stdio.h>
//int main()
//{
//	int a = 10;
//	int b = 20;
//	int temp = a;
//	a = b;
//	b = temp;
//	printf("a=%d b=%d", a, b);
//	return 0;
//}
//判断一个数二进制序列中有多少个1
//#include<stdio.h>
//int main()
//{
//	int a = -1;
//	int count = 0;
//	while (a)
//	{
//		if ((1&a) == 1)
//		{
//			count++;
//		}
//		a=a >> 1;
//	}
//	printf("%d", count);
//	return 0;
//}

//sizof()只是一个操作符—不是函数
//strlen—求字符串长度，只适用于字符串
//#include<stdio.h>
//int main()
//{
//	short s = 3;
//	int a = 10;
//	printf("%d\n", sizeof(s = a + 5));//sizeof求类型长度，结果认识变量类型大小
//	printf("%d", s);//s大小不会改变
//	return 0;
//}
//指针是变量，用来存储变量的地址
//#include<stdio.h>
//int main()
//{
//	int a = 10;//在内存中开辟一块空间
//	int* p = &a;//将变量a的地址放在变量p中，变量p被称为指针变量
//	//*为解引用操作符
//	printf("%d", *p);
//	return 0;
//}
