//题目名称：
//打印水仙花数
//题目内容：
//求出0～100000之间的所有“水仙花数”并输出。
//“水仙花数”是指一个n位数，其各位数字的n次方之和确好等于该数本身，
//如 : 153＝1 ^ 3＋5 ^ 3＋3 ^ 3，则153是一个“水仙花数”。
//#include<stdio.h>
//#include<math.h>
//int main()
//{
//	for (int i = 0; i < 100000; i++)
//	{
//		int temp = i;
//		int count = 1;
//		int sum = 0;
//		while (temp / 10)
//		{
//			count++;
//			temp = temp / 10;
//		}
//		temp = i;
//		while (temp)
//		{
//			sum += pow(temp % 10, count);
//			temp = temp / 10;
//		}
//		if (i == sum)
//		{
//			printf("%d ", i);
//		}
//	}
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int a = 20;
//	//原码：00000000 00000000 00000000 00010100
//	//反码：00000000 00000000 00000000 00010100
//	//补码：00000000 00000000 00000000 00010100
//	int b = -10;
//	//原码：10000000 00000000 00000000 000001010
//	//反码：11111111 11111111 11111111 111110101
//	//补码：11111111 11111111 11111111 111110110
//	int c = a + b;
//	//加法原理是补码相加：
//	//a的补码：00000000 00000000 00000000 00010100
//	//b的补码：11111111 11111111 11111111 11110110
//	//结果     11111111 11111111 11111111 11101010
//	//翻译原码 11111111 11111111 11111111 11101000
//	//         10000000 00000000 00000000 00010100
//	return 0;
//}

//数据在内存中的存储方式有两种
//大端存储：低位数据放在高地址处，高位数据放在低地址处
//小端存储：低位数据放在低地址处，高位数据放在高地址处（一般采用小端存储）
//int a=0x11223344
//低地址------------------------------->高地址
//大端存储：11 22 33 44
//小端存储：44 33 22 11
//设计程序证明机器是大端存储还是小端存储
//#include<stdio.h>
//int main()
//{
//	int a = 1;
//	//正常a：00 00 00 01
//	//大端存储:00 00 00 01
//	//小端存储:01 00 00 00
//	char* p = &a;
//	if (*p == 1)
//	{
//		printf("小端存储");
//	}
//	else
//	{
//		printf("大端存储");
//	}
//	return 0;
//}


//在屏幕上打印杨辉三角。
//#include<stdio.h>
//int main()
//{
//	int n = 0;
//	scanf_s("%d", &n);
//	int arr[20][20] = { 0 };
//	for (int i = 0; i <= n; i++)
//	{
//		for (int j = 0; j < i; j++)
//		{
//			arr[i][0] = 1;
//			if (i > 1 && j > 0)
//			{
//				arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//			}
//		}
//	}
//	for (int i = 0; i <= n; i++)
//	{
//		for (int j = 0; j < i; j++)
//		{
//			printf("%-2d  ", arr[i][j]);
//		}
//		printf("\n");
//	}
//}
//

//#include<stdio.h>
//int main()
//{
//	printf("%d", sizeof(float));
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int member[4] = { 0 }; 
//	int i;
//	for ( i = 0; i < 4; i++)
//	{
//		member[i] = 1; 
//		if ((member[0] != 1) +(member[2] == 1) +(member[3] == 1) +(member[3] != 1) == 3)
//		{
//			break;
//		}
//		member[i] = 0;
//	}
//	putchar('A' + i); 
//	return 0;
//}

